In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-2.1.4-cp311-cp311-win_amd64.whl (10.6 MB)
     ---------------------------------------- 10.6/10.6 MB 1.1 MB/s eta 0:00:00
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\janar\appdata\roaming\python\python311\site-packages (from pandas) (1.26.2)
Collecting python-dateutil>=2.8.2
  Downloading python_dateutil-2.8.2-py2.py3-none-any.whl (247 kB)
     -------------------------------------- 247.7/247.7 kB 1.4 MB/s eta 0:00:00
Requirement already satisfied: pytz>=2020.1 in c:\users\janar\appdata\roaming\python\python311\site-packages (from pandas) (2022.6)
Collecting tzdata>=2022.1
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     -------------------------------------- 341.8/341.8 kB 1.5 MB/s eta 0:00:00
Collecting six>=1.5
  Downloading six-1.16.0-py2.py3-none-any.whl (11 kB)
Installing collected packages: tzdata, six, python-dateutil, pandas
Successfully installed pandas-2.1.4 python-dateutil-2.8.2 six-1.16.0 tzdata-2023.3

[notice] A new release of pip available: 22.3 -> 23.3.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd

In [3]:
lst=['rohit','virat','mahi','sachin']

In [4]:
pd.Series(lst)

0     rohit
1     virat
2      mahi
3    sachin
dtype: object

In [6]:
new_series=pd.Series(lst,index=['a','b','c','d'])

In [7]:
new_series

a     rohit
b     virat
c      mahi
d    sachin
dtype: object

In [9]:
new_series['b']

'virat'

In [10]:
type(new_series['b'])

str

# Data Framing

In [11]:
import numpy as np

In [12]:
arr=np.random.randint(1,101,(4,6))

In [13]:
arr

array([[ 9, 77, 60, 46, 93, 46],
       [35, 23, 72, 74,  8,  1],
       [95, 79, 38, 11, 56, 94],
       [62, 29, 32, 64, 92,  1]])

In [16]:
arr=arr.reshape((6,4))

In [17]:
arr

array([[ 9, 77, 60, 46],
       [93, 46, 35, 23],
       [72, 74,  8,  1],
       [95, 79, 38, 11],
       [56, 94, 62, 29],
       [32, 64, 92,  1]])

In [24]:
df=pd.DataFrame(data=arr)

In [26]:
df=pd.DataFrame(data=arr,columns=['A','B','C','D'])

In [27]:
df

    A   B   C   D
0   9  77  60  46
1  93  46  35  23
2  72  74   8   1
3  95  79  38  11
4  56  94  62  29
5  32  64  92   1

In [28]:
df['D']

0    46
1    23
2     1
3    11
4    29
5     1
Name: D, dtype: int32

In [29]:
df.head(n=3)

    A   B   C   D
0   9  77  60  46
1  93  46  35  23
2  72  74   8   1

In [30]:
df.tail(2)

    A   B   C   D
4  56  94  62  29
5  32  64  92   1

In [31]:
df[['B','C','A']]

    B   C   A
0  77  60   9
1  46  35  93
2  74   8  72
3  79  38  95
4  94  62  56
5  64  92  32

In [32]:
df['A+B']=df['A']+df['B']

In [33]:
df

    A   B   C   D  A+B
0   9  77  60  46   86
1  93  46  35  23  139
2  72  74   8   1  146
3  95  79  38  11  174
4  56  94  62  29  150
5  32  64  92   1   96

In [34]:
df['A-B']=df['A']-df['B']

In [35]:
df

    A   B   C   D  A+B  A-B
0   9  77  60  46   86  -68
1  93  46  35  23  139   47
2  72  74   8   1  146   -2
3  95  79  38  11  174   16
4  56  94  62  29  150  -38
5  32  64  92   1   96  -32

In [36]:
df.drop(columns=['A-B']) # it will crete the new dataframe

    A   B   C   D  A+B
0   9  77  60  46   86
1  93  46  35  23  139
2  72  74   8   1  146
3  95  79  38  11  174
4  56  94  62  29  150
5  32  64  92   1   96

In [37]:
df

    A   B   C   D  A+B  A-B
0   9  77  60  46   86  -68
1  93  46  35  23  139   47
2  72  74   8   1  146   -2
3  95  79  38  11  174   16
4  56  94  62  29  150  -38
5  32  64  92   1   96  -32

In [38]:
df.drop(columns=['A-B'],inplace=True) # it will modifies the actual ones

In [39]:
df

    A   B   C   D  A+B
0   9  77  60  46   86
1  93  46  35  23  139
2  72  74   8   1  146
3  95  79  38  11  174
4  56  94  62  29  150
5  32  64  92   1   96

# Indexing

In [40]:
df.index="p q r s t u".split()

In [41]:
df

    A   B   C   D  A+B
p   9  77  60  46   86
q  93  46  35  23  139
r  72  74   8   1  146
s  95  79  38  11  174
t  56  94  62  29  150
u  32  64  92   1   96

In [42]:
df.loc['p']

A       9
B      77
C      60
D      46
A+B    86
Name: p, dtype: int32

In [43]:
df.loc[['p','q']]

    A   B   C   D  A+B
p   9  77  60  46   86
q  93  46  35  23  139

In [45]:
df.iloc[0:3]

    A   B   C   D  A+B
p   9  77  60  46   86
q  93  46  35  23  139
r  72  74   8   1  146

In [46]:
df.iloc[0:3][['C','D']]

    C   D
p  60  46
q  35  23
r   8   1

In [48]:
df.iloc[0:3,2:4]

    C   D
p  60  46
q  35  23
r   8   1

# Boolean Masking

In [49]:
df

    A   B   C   D  A+B
p   9  77  60  46   86
q  93  46  35  23  139
r  72  74   8   1  146
s  95  79  38  11  174
t  56  94  62  29  150
u  32  64  92   1   96

In [51]:
mask=df['B']>50

In [52]:
mask

p     True
q    False
r     True
s     True
t     True
u     True
Name: B, dtype: bool

In [53]:
df[mask]

    A   B   C   D  A+B
p   9  77  60  46   86
r  72  74   8   1  146
s  95  79  38  11  174
t  56  94  62  29  150
u  32  64  92   1   96

In [54]:
df[mask][['C','D']]

    C   D
p  60  46
r   8   1
s  38  11
t  62  29
u  92   1

In [55]:
df_array=df.values # it was the attribute not the function

In [56]:
df_array

array([[  9,  77,  60,  46,  86],
       [ 93,  46,  35,  23, 139],
       [ 72,  74,   8,   1, 146],
       [ 95,  79,  38,  11, 174],
       [ 56,  94,  62,  29, 150],
       [ 32,  64,  92,   1,  96]])

# Analzying the Dataset

In [63]:
iris = pd.read_csv("./iris.csv")

In [61]:
pwd

'D:\\Python for data science'

In [64]:
type(iris)

pandas.core.frame.DataFrame

In [65]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [67]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [68]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [71]:
iris.shape

(150, 5)

In [72]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [73]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [76]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [78]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [79]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [81]:
iris['species'].nunique()

3

In [82]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [87]:
iris[iris['species']=='virginica'].shape

(50, 5)

In [90]:
iris['species'].value_counts()['virginica']

50

In [93]:
iris['species'].value_counts()['setosa']

50

In [94]:
iris.head(n=5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [95]:
iris['sepal_length'].mean()

5.843333333333334

In [96]:
iris['sepal_length'].max()

7.9

In [97]:
iris['sepal_length'].min()

4.3

In [98]:
iris.sort_values(by=['sepal_length','sepal_width'])

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
8             4.4          2.9           1.4          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
42            4.4          3.2           1.3          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

# Grouping Data

In [6]:
iris=pd.read_csv('./iris.csv')

In [7]:
iris['species'].apply(len)

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [8]:
iris.apply(lambda x:x+x)

     sepal_length  sepal_width  petal_length  petal_width             species
0            10.2          7.0           2.8          0.4        setosasetosa
1             9.8          6.0           2.8          0.4        setosasetosa
2             9.4          6.4           2.6          0.4        setosasetosa
3             9.2          6.2           3.0          0.4        setosasetosa
4            10.0          7.2           2.8          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145          13.4          6.0          10.4          4.6  virginicavirginica
146          12.6          5.0          10.0          3.8  virginicavirginica
147          13.0          6.0          10.4          4.0  virginicavirginica
148          12.4          6.8          10.8          4.6  virginicavirginica
149          11.8          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

In [9]:
iris.aggregate('min')

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [10]:
iris.aggregate('max')

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [13]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [16]:
iris=pd.read_csv('./iris.csv')

In [25]:
import numpy

In [27]:
iris.aggregate(['min','max'])

     sepal_length  sepal_width  petal_length  petal_width    species
min           4.3          2.0           1.0          0.1     setosa
max           7.9          4.4           6.9          2.5  virginica

In [29]:
groupby=iris.groupby('species')

In [30]:
groupby

In [31]:
groupby.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [32]:
groupby.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

# handling the missing Values

In [1]:
import pandas as pd

In [2]:
iris=pd.read_csv('./iris.csv')

In [3]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [4]:
import numpy as np

In [6]:
iris_nan_index=np.random.randint(0,150,20)

In [7]:
iris_nan_index

array([ 13,  63,  30, 125, 148,  72,  86,  26,  96, 135,  18, 109,  66,
        52, 104,  25,  90,  70, 143, 141])

In [9]:
iris.isna()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [11]:
iris['sepal_length'][iris_nan_index]=np.nan

C:\Users\janar\AppData\Local\Temp\ipykernel_7084\39527365.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iris['sepal_length'][iris_nan_index]=np.nan

In [12]:
iris['sepal_length'][:50]

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    NaN
14    5.8
15    5.7
16    5.4
17    5.1
18    NaN
19    5.1
20    5.4
21    5.1
22    4.6
23    5.1
24    4.8
25    NaN
26    NaN
27    5.2
28    5.2
29    4.7
30    NaN
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [13]:
iris.isna()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148          True        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [15]:
iris.isna().sum()

sepal_length    20
sepal_width      0
petal_length     0
petal_width      0
species          0
dtype: int64

In [16]:
# fill some nan values in petal length
petal_nan_index=np.random.randint(0,151,20)
petal_nan_index

array([ 35,  23,  84,   3,  15,  13,  88, 102, 112,  64,  75, 113,  70,
        40,  38,  70, 141,  77,  66,  13])

In [17]:
iris['petal_length'][petal_nan_index]=np.nan

C:\Users\janar\AppData\Local\Temp\ipykernel_7084\877292782.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iris['petal_length'][petal_nan_index]=np.nan

In [20]:
iris['petal_length'].isna().sum()

18

In [21]:
iris['sepal_length'].fillna(value='I Miss you')[:50]

0            5.1
1            4.9
2            4.7
3            4.6
4            5.0
5            5.4
6            4.6
7            5.0
8            4.4
9            4.9
10           5.4
11           4.8
12           4.8
13    I Miss you
14           5.8
15           5.7
16           5.4
17           5.1
18    I Miss you
19           5.1
20           5.4
21           5.1
22           4.6
23           5.1
24           4.8
25    I Miss you
26    I Miss you
27           5.2
28           5.2
29           4.7
30    I Miss you
31           5.4
32           5.2
33           5.5
34           4.9
35           5.0
36           5.5
37           4.9
38           4.4
39           5.1
40           5.0
41           4.5
42           4.4
43           5.0
44           5.1
45           4.8
46           5.1
47           4.6
48           5.3
49           5.0
Name: sepal_length, dtype: object

In [23]:
iris['sepal_length']=iris['sepal_length'].fillna(value=round(iris['sepal_length'].mean(),1))

In [24]:
iris['petal_length']=iris['petal_length'].fillna(value=round(iris['petal_length'].mean(),2))

In [25]:
iris['sepal_length'][0:50]

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    5.8
14    5.8
15    5.7
16    5.4
17    5.1
18    5.8
19    5.1
20    5.4
21    5.1
22    4.6
23    5.1
24    4.8
25    5.8
26    5.8
27    5.2
28    5.2
29    4.7
30    5.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

# Merging Dataframes

In [26]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           3.8          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           5.8          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [28]:
new=np.random.randint(1,10,(5,5))

In [39]:
new_df=pd.DataFrame(data=new)

In [40]:
new_df

   0  1  2  3  4
0  2  1  8  2  6
1  7  9  1  5  4
2  8  7  9  1  1
3  2  7  9  4  9
4  9  6  9  2  9

In [41]:
new_df.drop(columns=4,inplace=True)

In [42]:
new_df

   0  1  2  3
0  2  1  8  2
1  7  9  1  5
2  8  7  9  1
3  2  7  9  4
4  9  6  9  2

In [44]:
new_df['species']=['newspecies','newspecies','newspecies','newspecies','newspecies']

In [45]:
new_df

   0  1  2  3     species
0  2  1  8  2  newspecies
1  7  9  1  5  newspecies
2  8  7  9  1  newspecies
3  2  7  9  4  newspecies
4  9  6  9  2  newspecies

In [46]:
new_df.columns=iris.columns

In [47]:
new_df

   sepal_length  sepal_width  petal_length  petal_width     species
0             2            1             8            2  newspecies
1             7            9             1            5  newspecies
2             8            7             9            1  newspecies
3             2            7             9            4  newspecies
4             9            6             9            2  newspecies

In [51]:
pd.concat((iris,new_df),axis=1) # axis=0 (vertical) and axis=1 (horizontal)

,sepal_length,sepal_width,petal_length,petal_width,species,sepal_length,sepal_width,petal_length,petal_width,species
0,5.1,3.5,1.4,0.2,setosa,2.0,1.0,8.0,2.0,newspecies
1,4.9,3.0,1.4,0.2,setosa,7.0,9.0,1.0,5.0,newspecies
2,4.7,3.2,1.3,0.2,setosa,8.0,7.0,9.0,1.0,newspecies
3,4.6,3.1,3.8,0.2,setosa,2.0,7.0,9.0,4.0,newspecies
4,5.0,3.6,1.4,0.2,setosa,9.0,6.0,9.0,2.0,newspecies
...,...,...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,NaN,NaN,NaN,NaN,NaN
146,6.3,2.5,5.0,1.9,virginica,NaN,NaN,NaN,NaN,NaN
147,6.5,3.0,5.2,2.0,virginica,NaN,NaN,NaN,NaN,NaN
148,5.8,3.4,5.4,2.3,virginica,NaN,NaN,NaN,NaN,NaN
149,5.9,3.0,5.1,1.8,virginica,NaN,NaN,NaN,NaN,NaN

# DataMerging

In [52]:
table1=pd.DataFrame({'S_Name':['jana','mahi','guru','jeevan'],'CGPA':[2,3,5,4]})

In [55]:
table1

   S_Name  CGPA
0    jana     2
1    mahi     3
2    guru     5
3  jeevan     4

In [58]:
table2=pd.DataFrame({'T_name':['Raghu','jason','rock','lewis'],'CGPA':[4,2,6,7]})

In [59]:
table2

  T_name  CGPA
0  Raghu     4
1  jason     2
2   rock     6
3  lewis     7

In [61]:
table1.merge(table2,how='left')

   S_Name  CGPA T_name
0    jana     2  jason
1    mahi     3    NaN
2    guru     5    NaN
3  jeevan     4  Raghu

In [62]:
table1.merge(table2,how='right')

   S_Name  CGPA T_name
0  jeevan     4  Raghu
1    jana     2  jason
2     NaN     6   rock
3     NaN     7  lewis

In [63]:
table1.merge(table2,how='inner')

   S_Name  CGPA T_name
0    jana     2  jason
1  jeevan     4  Raghu

In [64]:
table1.merge(table2,how='outer')

   S_Name  CGPA T_name
0    jana     2  jason
1    mahi     3    NaN
2    guru     5    NaN
3  jeevan     4  Raghu
4     NaN     6   rock
5     NaN     7  lewis